{
  "role": "VP of Sales",
  "scoring_guide": "1=No fit, 2=Weak, 3=Mixed, 4=Strong, 5=Exceptional (repeated high-signal evidence)",
  "categories": [
    {
      "name": "Stage fit (startup, player-coach)",
      "weight": 0.2,
      "criteria": "Repeated 'build from scratch' + hands-on leadership; thrives with constraints; has personally carried deals while building team/process. Early-stage roles, scope ownership, player-coach indicators, scrappy execution.",
      "sample_questions": [
        "Describe a time you built sales from scratch in an early-stage company. What was the headcount and stage?",
        "Tell me about a role where you were player-coach—personally carrying deals while building the team.",
        "How have you operated with limited resources or ambiguity? Give a specific example.",
        "Walk me through scaling from $20M to $100M ARR—what was your direct ownership?"
      ]
    },
    {
      "name": "Enterprise SaaS complex sales",
      "weight": 0.25,
      "criteria": "Clear pattern of $100K+ ACV, multi-stakeholder, 3–6+ month cycles; scaled a repeatable enterprise motion. Deal size, cycle length, buyer seniority, logos, enterprise expansion.",
      "sample_questions": [
        "What deal sizes have you closed (ACV)? Give examples of $100K–$250K+ deals.",
        "Describe your typical enterprise sales cycle length and multi-stakeholder dynamics.",
        "Who were the buyers—CXO, CIO, COO? Walk me through a complex deal you led.",
        "How did you scale from ~$20M to ~$100M in revenue? What was your role?"
      ]
    },
    {
      "name": "Sales leadership (hire, coach, perform)",
      "weight": 0.2,
      "criteria": "Built and led AE org with clear bar-raising; performance management, ramp plans, consistent attainment. Hiring volume/quality, org design, promotions, attrition, quota attainment of team.",
      "sample_questions": [
        "How have you built and scaled an AE team? Hiring volume, bar-raising, and org design?",
        "Describe your approach to performance management and handling underperformers.",
        "What ramp plans and development practices did you use? Promotions from within?",
        "What was your team's quota attainment over the last few years? How did you inspect and improve?"
      ]
    },
    {
      "name": "Pipeline creation + expansion (outbound rigor)",
      "weight": 0.15,
      "criteria": "Built predictable outbound engine + repeatable expansion motion; coverage model + conversion metrics. Outbound motions, ICP clarity, activity-to-meeting-to-pipeline metrics, expansion/upsell record.",
      "sample_questions": [
        "Describe the outbound engine you built—ICP, coverage model, channel mix, and conversion metrics.",
        "How did you measure pipeline creation (activity to meeting to pipeline)? What worked?",
        "Tell me about your expansion/upsell motion. How repeatable was it?",
        "Have you run or overseen SDR/cold outbound teams? What was the cadence and result?"
      ]
    },
    {
      "name": "Forecasting + operating cadence",
      "weight": 0.1,
      "criteria": "Clear inspection rhythm with leading indicators; forecast hygiene; corrective loops that improved predictability. Weekly cadence, pipeline inspection, forecast accuracy, leading indicators.",
      "sample_questions": [
        "What was your weekly operating cadence? Pipeline inspection, forecast review, QBRs?",
        "How did you improve forecast accuracy over time? What leading indicators did you use?",
        "Describe a time you had to correct course based on pipeline or forecast data.",
        "What KPIs did you own and how did you inspect them with the team?"
      ]
    },
    {
      "name": "BFSI / regulated buyers",
      "weight": 0.1,
      "criteria": "Direct BFSI wins or strong adjacency; credible with security/procurement/compliance-heavy buyers. BFSI logos, regulated industries, security/procurement navigation, compliance credibility.",
      "sample_questions": [
        "Have you sold into banks, credit unions, or other BFSI/regulated buyers? Which logos?",
        "How do you navigate security, procurement, and compliance in enterprise deals?",
        "Describe a deal where you had to work through legal or compliance with the buyer.",
        "Any experience in fintech, CX platforms, or selling to financial institutions?"
      ]
    }
  ],
  "non_negotiables_summary": "Scaled revenue ~$20M to ≥$100M with direct ownership; built or scaled sales org in early-stage (<200); 12–20 years Enterprise SaaS, 5+ years leading AE teams; closed $100K–$250K+ ACV; sold to CXO/CIO/COO; 3–6 month cycles; owned Enterprise + Strategic segments; built outbound-led pipeline engine; tenure stability (≥3 years in key roles).",
  "preferred": "CX domain experience, AI selling experience, selling into Banks/Credit Unions (BFSI)."
}
